Repository: rafaelchampion/PackageDeployer
Catalog: src/PackageDeployer.Lang/GlobalStrings.*.resx
Languages: pt_br

# Option-NewRepository
source: New repository
pt_br: Novo repositório

# Prompt-SelectOrCreateRepositoryConfig
source: Select an existing repository or create a new repository configuration
pt_br: Selecione um repositório existente ou crie uma nova configuração de repositório

# Prompt-EnterRepositoryName
source: Enter the new repository name (ProjectTeam/Repository)
pt_br: Insira o nome do novo repositório (Projeto/Repositorio)

# Prompt-EnterGitHubToken
source: Enter the new repository name (ProjectTeam/Repository)
pt_br: Insira o token do GitHub do novo repositório

# Prompt-WishToSaveConfig
source: Do you wish to save this repository configuration?
pt_br: Deseja salvar a configuração do novo repositório?

# Error-InvalidRepositoryFormat
source: Error - Invalid repository name format
pt_br: Erro - O formato de nome do repositório é inválido

# Info-CloningRepository
source: Cloning repository...
pt_br: Clonando repositório...

# Info-RepositoryClonedSuccessfully
source: Repository cloned successfully.
pt_br: Repositório clonado com sucesso.

# Info-BuildingProject
source: Building project...
pt_br: Realizando build no projeto...

# Info-ProjectBuiltSuccessfully
source: Project built successfully.
pt_br: Build do projeto realizada com sucesso.

# Prompt-EnterDestinationFolder
source: Enter the publish destination folder path
pt_br: Insira o caminho da pasta de destino da publicação

# Prompt-WishToSavePublishConfiguration
source: Do you wish to save this project's publish configuration?
pt_br: Deseja salvar a configuração de publicação deste projeto?

# Info-CopyingFilesToThePublishDestinationFolder
source: Copying files to the publish folder...
pt_br: Copiando arquivos para a pasta de destino da publicação...

# Option-Exit
source: Exit
pt_br: Sair

# Error-MainLoop
source: An error occurred during the main loop:
pt_br: Ocorreu um erro no loop principal:

# Error-HandleNewRepository
source: An error occurred while handling a new repository:
pt_br: Ocorreu um erro ao processar o novo repositório:

# Error-RepositoryNotFound
source: Repository not found
pt_br: Repositório não encontrado

# Error-HandleExistingRepository
source: An error occurred while handling an existing repository
pt_br: Ocorreu um erro ao processar o repositório existente

# Error-ProcessingRepository
source: An error occurred while processing the repository:
pt_br: Ocorreu um erro ao processar o repositório:

# Prompt-SelectProject
source: Select a project
pt_br: Selecione um projeto

# Prompt-SelectBranch
source: Select a branch
pt_br: Selecione uma branch

# Info-PublishFolderFound
source: Publish folder found at:
pt_br: Pasta de publicação encontrada em:

# Prompt-WishToUseExistingPublishFolder
source: Do you wish to use the existing publish folder?
pt_br: Deseja utilizar a pasta de publicação existente?

# Info-UsingPublishFolder
source: Using publish folder:
pt_br: Utilizando a seguinte pasta para publicação:

# Info-ProjectBuildStarted
source: Project build started.
pt_br: Build do projeto iniciada.

# Info-FileCopyStarted
source: Started file copy to publish folder.
pt_br: Iniciada a transferência dos arquivos para a pasta de publicação.

# Info-DeploymentFinish
source: Deployment finished!
pt_br: Publicação finalizada!

# Info-FilesCopiedSuccessfully
source: Files copied successfully.
pt_br: Arquivos transferidos com sucesso.

# Prompt-PressToFinish
source: Press any key to finish
pt_br: Pressione qualquer tecla para finalizar

# Prompt_UseReleaseConfiguration
source: Would you like to use the Release configuration? (If not, the Debug configuration will be used instead)
pt_br: Deseja utilizar a configuração Release? (Caso não, a configuração Debug será utilizada)

# Info_ProjectPublishStarted
source: Project publish started.
pt_br: Publicação do projeto iniciada.

# Info_PublishingProject
source: Publishing project...
pt_br: Publicando projeto...

# Info_ProjectPublishedSuccessfully
source: Project published successfully.
pt_br: Projeto publicado com sucesso.

# Error_ProjectPublishFailed
source: Project build failed.
pt_br: Publicação do projeto falhou.

# Error_MSBuildNotFound
source: MSBuild not found
pt_br: MSBuild não encontrado.

# Error_DotNetNotFound
source: DotNet (build) not found.
pt_br: Ferramenta de build do DotNet não encontrada.

# Error_CloningOrUpdatingRepository
source: Error cloning/updating repository.
pt_br: Erro ao clonar/atualizar repositório.

# Info-UpdatingRepository
source: Updating repository...
pt_br: Atualizando repositório...

# Info_RepositoryUpdatedSuccessfully
source: Repository updated successfully.
pt_br: Repositório atualizado com sucesso.

# Prompt_SelectOrCreateBranchConfig
source: Select an existing branch configuration or create a new one.
pt_br: Selecione uma configuração de branch existente ou crie uma nova.

# Option-NewBranch
source: New branch
pt_br: Nova branch

# Prompt_SelectOrCreateProjectConfig
source: Select an existing project configuration or create a new one.
pt_br: Selecione uma configuração de projeto existente ou crie uma nova.

# Option_NewProject
source: New project
pt_br: Novo projeto
